; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	satellite6 - satellite
	instrument9 - instrument
	satellite7 - satellite
	instrument10 - instrument
	instrument11 - instrument
	image3 - mode
	image1 - mode
	infrared0 - mode
	infrared2 - mode
	Star1 - direction
	Star6 - direction
	Star2 - direction
	Star5 - direction
	Star3 - direction
	GroundStation0 - direction
	Star4 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image3)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument2 image3)
	(calibration_target instrument2 Star3)
	(supports instrument3 image1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument4 infrared2)
	(supports instrument4 image1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star4)
	(supports instrument6 image3)
	(supports instrument6 infrared2)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 Star3)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet9)
	(supports instrument7 infrared0)
	(supports instrument7 image3)
	(calibration_target instrument7 Star5)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
	(supports instrument8 infrared2)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 Star4)
	(on_board instrument8 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star2)
	(supports instrument9 infrared2)
	(calibration_target instrument9 Star3)
	(on_board instrument9 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star3)
	(supports instrument10 infrared2)
	(calibration_target instrument10 GroundStation0)
	(supports instrument11 image3)
	(supports instrument11 image1)
	(supports instrument11 infrared2)
	(calibration_target instrument11 Star4)
	(on_board instrument10 satellite7)
	(on_board instrument11 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star5)
)
(:goal (and
	(pointing satellite2 Star6)
	(pointing satellite3 Phenomenon10)
	(pointing satellite4 Planet8)
	(pointing satellite5 Star11)
	(pointing satellite6 Star4)
	(pointing satellite7 Star5)
	(have_image Star7 infrared2)
	(have_image Planet8 image1)
	(have_image Planet9 image1)
	(have_image Phenomenon10 infrared2)
	(have_image Star11 infrared2)
))

)

; plan
1. (turn_to satellite5 star11 star2)
   deleted: (pointing satellite5 star2)
   added: (pointing satellite5 star11)
   goals met: 2 of 11
2. (turn_to satellite4 planet8 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 planet8)
   goals met: 3 of 11
3. (turn_to satellite3 groundstation0 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 groundstation0)
   goals met: 3 of 11
4. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 3 of 11
5. (calibrate satellite3 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 3 of 11
6. (turn_to satellite3 planet9 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet9)
   goals met: 3 of 11
7. (take_image satellite3 planet9 instrument4 image1)
   added: (have_image planet9 image1)
   goals met: 4 of 11
8. (turn_to satellite3 planet8 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 planet8)
   goals met: 4 of 11
9. (turn_to satellite2 star6 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star6)
   goals met: 5 of 11
10. (take_image satellite3 planet8 instrument4 image1)
   added: (have_image planet8 image1)
   goals met: 6 of 11
11. (turn_to satellite3 star11 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star11)
   goals met: 6 of 11
12. (take_image satellite3 star11 instrument4 infrared2)
   added: (have_image star11 infrared2)
   goals met: 7 of 11
13. (turn_to satellite3 star7 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star7)
   goals met: 7 of 11
14. (take_image satellite3 star7 instrument4 infrared2)
   added: (have_image star7 infrared2)
   goals met: 8 of 11
15. (turn_to satellite3 phenomenon10 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 phenomenon10)
   goals met: 9 of 11
16. (take_image satellite3 phenomenon10 instrument4 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 10 of 11
17. (turn_to satellite6 star4 star3)
   deleted: (pointing satellite6 star3)
   added: (pointing satellite6 star4)
   goals met: 11 of 11
